<template>
  <div>
    <div class="nav-bar">
      <div class="container">
        <div class="content">
          <div class="logo"><img src="../assets/images/logo.png" alt="img" loading="lazy"></div>
          <ul class="navbar-links">
            <li><a href="/">الرئيسيه</a></li>
            <!-- <li class="has-submenu">
              <span>الدورات </span>
              <ul class="submenu">
                <li><a href="">الدوره أ</a></li>
                <li><a href="">الدوره ب</a></li>
                <li><a href="">الدوره ج</a></li>
              </ul>
            </li> -->
            <li class="has-submenu">
              <span>الرخصه</span>
            </li>
            <li class="has-submenu">
              <span>حاسبه النقاط</span>
            </li>
            <li><nuxt-link to="/market" >المتجر</nuxt-link></li>
          </ul>
          <ul class="icons">
            <li>
              <div class="badge bg-danger">{{ getCartProductsLength }}</div>
              <nuxt-link  to="/cart">
                <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25" fill="none">
                  <g clip-path="url(#clip0_2593_1220)">
                    <path d="M23.1056 4.28208C22.8243 3.94452 22.4721 3.67303 22.0741 3.48689C21.6761 3.30076 21.242 3.20454 20.8026 3.20508H4.63458L4.59258 2.85408C4.50663 2.1245 4.15596 1.45181 3.60707 0.963556C3.05817 0.475301 2.34921 0.20542 1.61458 0.205078L1.39258 0.205078C1.12736 0.205078 0.873008 0.310435 0.685471 0.497971C0.497935 0.685508 0.392578 0.939862 0.392578 1.20508C0.392578 1.47029 0.497935 1.72465 0.685471 1.91218C0.873008 2.09972 1.12736 2.20508 1.39258 2.20508H1.61458C1.85951 2.20511 2.09592 2.29503 2.27895 2.45779C2.46199 2.62055 2.57892 2.84483 2.60758 3.08808L3.98358 14.7881C4.12643 16.0049 4.71106 17.1269 5.62649 17.9411C6.54192 18.7553 7.72443 19.2051 8.94958 19.2051H19.3926C19.6578 19.2051 19.9121 19.0997 20.0997 18.9122C20.2872 18.7246 20.3926 18.4703 20.3926 18.2051C20.3926 17.9399 20.2872 17.6855 20.0997 17.498C19.9121 17.3104 19.6578 17.2051 19.3926 17.2051H8.94958C8.33063 17.2033 7.72738 17.0102 7.22251 16.6521C6.71765 16.2941 6.33589 15.7886 6.12958 15.2051H18.0496C19.2219 15.2051 20.3569 14.7933 21.2564 14.0415C22.1559 13.2897 22.7626 12.2458 22.9706 11.0921L23.7556 6.73808C23.8339 6.30609 23.8163 5.86214 23.704 5.43772C23.5917 5.01329 23.3874 4.61875 23.1056 4.28208ZM21.7926 6.38308L21.0066 10.7371C20.8817 11.4301 20.517 12.0571 19.9764 12.5083C19.4358 12.9595 18.7537 13.2061 18.0496 13.2051H5.81158L4.87058 5.20508H20.8026C20.9495 5.2042 21.0948 5.2357 21.2281 5.29733C21.3615 5.35897 21.4796 5.44922 21.5741 5.56169C21.6686 5.67415 21.7372 5.80605 21.775 5.94802C21.8127 6.08998 21.8187 6.23852 21.7926 6.38308Z" fill="#222222"/>
                    <path d="M7.3927 24.206C8.49726 24.206 9.39269 23.3106 9.39269 22.2061C9.39269 21.1015 8.49726 20.2061 7.3927 20.2061C6.28813 20.2061 5.3927 21.1015 5.3927 22.2061C5.3927 23.3106 6.28813 24.206 7.3927 24.206Z" fill="#222222"/>
                    <path d="M17.3926 24.206C18.4971 24.206 19.3926 23.3106 19.3926 22.2061C19.3926 21.1015 18.4971 20.2061 17.3926 20.2061C16.288 20.2061 15.3926 21.1015 15.3926 22.2061C15.3926 23.3106 16.288 24.206 17.3926 24.206Z" fill="#222222"/>
                  </g>
                  <defs>
                    <clipPath id="clip0_2593_1220">
                      <rect width="24" height="24" fill="white" transform="translate(0.392578 0.205078)"/>
                    </clipPath>
                  </defs>
                </svg>
              </nuxt-link>
            </li>
            <li>
              <a href="">
                <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25" fill="none">
                  <g clip-path="url(#clip0_2593_1226)">
                    <path d="M23.6514 17L21.0514 7.62898C20.4962 5.6244 19.2864 3.86312 17.6147 2.62546C15.9429 1.38781 13.9052 0.744901 11.8258 0.79906C9.7465 0.85322 7.74502 1.60134 6.13995 2.92434C4.53488 4.24735 3.41846 6.06921 2.96837 8.09998L0.957371 17.15C0.860064 17.5884 0.862438 18.0431 0.964317 18.4805C1.0662 18.9179 1.26498 19.3269 1.54601 19.6772C1.82703 20.0275 2.18312 20.3103 2.58802 20.5046C2.99291 20.6989 3.43626 20.7999 3.88537 20.8H7.49237C7.72189 21.9303 8.3351 22.9465 9.22811 23.6764C10.1211 24.4063 11.239 24.805 12.3924 24.805C13.5457 24.805 14.6636 24.4063 15.5566 23.6764C16.4496 22.9465 17.0629 21.9303 17.2924 20.8H20.7624C21.2245 20.7998 21.6803 20.6928 22.0943 20.4874C22.5082 20.2821 22.8692 19.9838 23.1489 19.616C23.4286 19.2482 23.6196 18.8207 23.7069 18.367C23.7943 17.9132 23.7756 17.4454 23.6524 17H23.6514ZM12.3924 22.8C11.7741 22.7974 11.1717 22.6039 10.6677 22.2459C10.1636 21.8879 9.78245 21.3829 9.57637 20.8H15.2084C15.0023 21.3829 14.6211 21.8879 14.1171 22.2459C13.613 22.6039 13.0106 22.7974 12.3924 22.8ZM21.5574 18.405C21.4641 18.5287 21.3431 18.6288 21.2042 18.6974C21.0653 18.766 20.9123 18.8011 20.7574 18.8H3.88537C3.73563 18.8 3.58781 18.7663 3.45282 18.7015C3.31783 18.6367 3.19911 18.5424 3.10543 18.4256C3.01174 18.3088 2.94549 18.1724 2.91156 18.0266C2.87763 17.8808 2.87688 17.7291 2.90937 17.583L4.92037 8.53298C5.27472 6.93918 6.15168 5.50958 7.41183 4.47143C8.67198 3.43327 10.243 2.84615 11.8751 2.80339C13.5073 2.76063 15.1069 3.26469 16.4197 4.23545C17.7325 5.2062 18.6831 6.58792 19.1204 8.16098L21.7204 17.532C21.7628 17.6802 21.7702 17.8362 21.7419 17.9877C21.7136 18.1392 21.6504 18.2821 21.5574 18.405Z" fill="#222222"/>
                  </g>
                  <defs>
                    <clipPath id="clip0_2593_1226">
                      <rect width="24" height="24" fill="white" transform="translate(0.392578 0.799805)"/>
                    </clipPath>
                  </defs>
                </svg>
              </a>
            </li>
            <button @click="toggleSearchBar">
                <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25" fill="none">
                  <g clip-path="url(#clip0_2593_1224)">
                    <path d="M24.0994 22.8729L18.1304 16.9039C19.757 14.9145 20.5567 12.376 20.3642 9.81342C20.1717 7.25089 19.0016 4.86039 17.0959 3.13638C15.1903 1.41237 12.695 0.486752 10.126 0.550984C7.55705 0.615216 5.11106 1.66438 3.29397 3.48147C1.47688 5.29856 0.427716 7.74455 0.363484 10.3135C0.299252 12.8825 1.22487 15.3778 2.94888 17.2834C4.67289 19.1891 7.06339 20.3592 9.62592 20.5517C12.1885 20.7442 14.727 19.9445 16.7164 18.3179L22.6854 24.2869C22.874 24.469 23.1266 24.5698 23.3888 24.5675C23.651 24.5653 23.9018 24.4601 24.0872 24.2747C24.2726 24.0893 24.3778 23.8385 24.38 23.5763C24.3823 23.3141 24.2815 23.0615 24.0994 22.8729ZM10.3924 18.5799C8.81011 18.5799 7.26339 18.1107 5.9478 17.2316C4.63221 16.3526 3.60682 15.1031 3.00132 13.6413C2.39582 12.1795 2.2374 10.571 2.54608 9.01914C2.85476 7.46729 3.61669 6.04183 4.73551 4.92301C5.85433 3.80419 7.27979 3.04226 8.83164 2.73358C10.3835 2.4249 11.992 2.58332 13.4538 3.18882C14.9156 3.79432 16.1651 4.81971 17.0441 6.1353C17.9232 7.45089 18.3924 8.99761 18.3924 10.5799C18.39 12.7009 17.5464 14.7343 16.0466 16.2341C14.5468 17.7339 12.5134 18.5775 10.3924 18.5799Z" fill="#222222"/>
                  </g>
                  <defs>
                    <clipPath id="clip0_2593_1224">
                      <rect width="24" height="24" fill="white" transform="translate(0.392578 0.579102)"/>
                    </clipPath>
                  </defs>
                </svg>
            </button>
            <button>
              English
              <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 24 25" fill="none">
                <g clip-path="url(#clip0_2593_1230)">
                  <path d="M12 0.799805C9.62663 0.799805 7.30655 1.50359 5.33316 2.82217C3.35977 4.14075 1.8217 6.01489 0.913451 8.2076C0.00519943 10.4003 -0.232441 12.8131 0.230582 15.1409C0.693605 17.4687 1.83649 19.6069 3.51472 21.2851C5.19295 22.9633 7.33115 24.1062 9.65892 24.5692C11.9867 25.0323 14.3995 24.7946 16.5922 23.8864C18.7849 22.9781 20.6591 21.44 21.9776 19.4667C23.2962 17.4933 24 15.1732 24 12.7998C23.9966 9.61826 22.7312 6.56802 20.4815 4.31832C18.2318 2.06863 15.1815 0.803246 12 0.799805V0.799805ZM20.647 7.79981H17.426C16.705 6.12879 15.7556 4.56589 14.605 3.1558C17.1515 3.84873 19.3223 5.51727 20.647 7.79981ZM16.5 12.7998C16.4918 13.8179 16.3314 14.8291 16.024 15.7998H7.97601C7.66866 14.8291 7.50821 13.8179 7.50001 12.7998C7.50821 11.7817 7.66866 10.7705 7.97601 9.79981H16.024C16.3314 10.7705 16.4918 11.7817 16.5 12.7998ZM8.77801 17.7998H15.222C14.3732 19.4755 13.2882 21.0206 12 22.3878C10.7114 21.021 9.62625 19.4758 8.77801 17.7998ZM8.77801 7.79981C9.62677 6.12408 10.7119 4.57896 12 3.2118C13.2886 4.57858 14.3738 6.12376 15.222 7.79981H8.77801ZM9.40001 3.1558C8.24767 4.56559 7.29659 6.1285 6.57401 7.79981H3.35301C4.67886 5.51624 6.85166 3.84756 9.40001 3.1558ZM2.46101 9.79981H5.90001C5.64076 10.7789 5.50636 11.7869 5.50001 12.7998C5.50636 13.8127 5.64076 14.8207 5.90001 15.7998H2.46101C1.84635 13.847 1.84635 11.7526 2.46101 9.79981ZM3.35301 17.7998H6.57401C7.29659 19.4711 8.24767 21.034 9.40001 22.4438C6.85166 21.7521 4.67886 20.0834 3.35301 17.7998ZM14.605 22.4438C15.7556 21.0337 16.705 19.4708 17.426 17.7998H20.647C19.3223 20.0823 17.1515 21.7509 14.605 22.4438ZM21.539 15.7998H18.1C18.3592 14.8207 18.4936 13.8127 18.5 12.7998C18.4936 11.7869 18.3592 10.7789 18.1 9.79981H21.537C22.1517 11.7526 22.1517 13.847 21.537 15.7998H21.539Z" fill="#222222"/>
                </g>
                <defs>
                  <clipPath id="clip0_2593_1230">
                    <rect width="24" height="24" fill="white" transform="translate(0 0.799805)"/>
                  </clipPath>
                </defs>
              </svg>
            </button>
            <a href="" class="user">
              <div class="image-wrap"><img src="../assets/images/person.jpg" alt="img" loading="lazy"></div>
              <h3 class="name">محمد المكاوي</h3>
            </a>
          </ul>
          <button class="mobile-menu-btn" @click="toggleMobileMenu">
            <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" class="bi bi-list" viewBox="0 0 16 16">
              <path fill-rule="evenodd" d="M2.5 12a.5.5 0 0 1 .5-.5h10a.5.5 0 0 1 0 1H3a.5.5 0 0 1-.5-.5m0-4a.5.5 0 0 1 .5-.5h10a.5.5 0 0 1 0 1H3a.5.5 0 0 1-.5-.5m0-4a.5.5 0 0 1 .5-.5h10a.5.5 0 0 1 0 1H3a.5.5 0 0 1-.5-.5"/>
            </svg>
          </button>
        </div>
        <div :style="{height: mobilemenuStyleHeight}" class="mobile-menu">
          <button class="close-icon" @click="toggleMobileMenu">X</button>
          <ul class="mobile-links">
            <li><a href="/">الرئيسيه</a></li>
            <!-- <li class="has-submenu">
              <span>الدورات </span>
              <ul class="submenu">
                <li><a href="">الدوره أ</a></li>
                <li><a href="">الدوره ب</a></li>
                <li><a href="">الدوره ج</a></li>
              </ul>
            </li> -->
            <li class="has-submenu">
              <span>الرخصه</span>
            </li>
            <li class="has-submenu">
              <span>حاسبه النقاط</span>
            </li>
            <li @click="toggleMobileMenu" ><nuxt-link to="/market" >المتجر</nuxt-link></li>
          </ul>
          <ul class="mobile-icons">
            <li>
              <div class="badge bg-danger">{{ getCartProductsLength }}</div>
              <nuxt-link to="/cart"  @click="toggleMobileMenuAndMenuHeight">
                <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25" fill="none">
                  <g clip-path="url(#clip0_2593_1220)">
                    <path d="M23.1056 4.28208C22.8243 3.94452 22.4721 3.67303 22.0741 3.48689C21.6761 3.30076 21.242 3.20454 20.8026 3.20508H4.63458L4.59258 2.85408C4.50663 2.1245 4.15596 1.45181 3.60707 0.963556C3.05817 0.475301 2.34921 0.20542 1.61458 0.205078L1.39258 0.205078C1.12736 0.205078 0.873008 0.310435 0.685471 0.497971C0.497935 0.685508 0.392578 0.939862 0.392578 1.20508C0.392578 1.47029 0.497935 1.72465 0.685471 1.91218C0.873008 2.09972 1.12736 2.20508 1.39258 2.20508H1.61458C1.85951 2.20511 2.09592 2.29503 2.27895 2.45779C2.46199 2.62055 2.57892 2.84483 2.60758 3.08808L3.98358 14.7881C4.12643 16.0049 4.71106 17.1269 5.62649 17.9411C6.54192 18.7553 7.72443 19.2051 8.94958 19.2051H19.3926C19.6578 19.2051 19.9121 19.0997 20.0997 18.9122C20.2872 18.7246 20.3926 18.4703 20.3926 18.2051C20.3926 17.9399 20.2872 17.6855 20.0997 17.498C19.9121 17.3104 19.6578 17.2051 19.3926 17.2051H8.94958C8.33063 17.2033 7.72738 17.0102 7.22251 16.6521C6.71765 16.2941 6.33589 15.7886 6.12958 15.2051H18.0496C19.2219 15.2051 20.3569 14.7933 21.2564 14.0415C22.1559 13.2897 22.7626 12.2458 22.9706 11.0921L23.7556 6.73808C23.8339 6.30609 23.8163 5.86214 23.704 5.43772C23.5917 5.01329 23.3874 4.61875 23.1056 4.28208ZM21.7926 6.38308L21.0066 10.7371C20.8817 11.4301 20.517 12.0571 19.9764 12.5083C19.4358 12.9595 18.7537 13.2061 18.0496 13.2051H5.81158L4.87058 5.20508H20.8026C20.9495 5.2042 21.0948 5.2357 21.2281 5.29733C21.3615 5.35897 21.4796 5.44922 21.5741 5.56169C21.6686 5.67415 21.7372 5.80605 21.775 5.94802C21.8127 6.08998 21.8187 6.23852 21.7926 6.38308Z" fill="#222222"/>
                    <path d="M7.3927 24.206C8.49726 24.206 9.39269 23.3106 9.39269 22.2061C9.39269 21.1015 8.49726 20.2061 7.3927 20.2061C6.28813 20.2061 5.3927 21.1015 5.3927 22.2061C5.3927 23.3106 6.28813 24.206 7.3927 24.206Z" fill="#222222"/>
                    <path d="M17.3926 24.206C18.4971 24.206 19.3926 23.3106 19.3926 22.2061C19.3926 21.1015 18.4971 20.2061 17.3926 20.2061C16.288 20.2061 15.3926 21.1015 15.3926 22.2061C15.3926 23.3106 16.288 24.206 17.3926 24.206Z" fill="#222222"/>
                  </g>
                  <defs>
                    <clipPath id="clip0_2593_1220">
                      <rect width="24" height="24" fill="white" transform="translate(0.392578 0.205078)"/>
                    </clipPath>
                  </defs>
                </svg>
              </nuxt-link>
            </li>
            <li>
              <a href="">
                <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25" fill="none">
                  <g clip-path="url(#clip0_2593_1226)">
                    <path d="M23.6514 17L21.0514 7.62898C20.4962 5.6244 19.2864 3.86312 17.6147 2.62546C15.9429 1.38781 13.9052 0.744901 11.8258 0.79906C9.7465 0.85322 7.74502 1.60134 6.13995 2.92434C4.53488 4.24735 3.41846 6.06921 2.96837 8.09998L0.957371 17.15C0.860064 17.5884 0.862438 18.0431 0.964317 18.4805C1.0662 18.9179 1.26498 19.3269 1.54601 19.6772C1.82703 20.0275 2.18312 20.3103 2.58802 20.5046C2.99291 20.6989 3.43626 20.7999 3.88537 20.8H7.49237C7.72189 21.9303 8.3351 22.9465 9.22811 23.6764C10.1211 24.4063 11.239 24.805 12.3924 24.805C13.5457 24.805 14.6636 24.4063 15.5566 23.6764C16.4496 22.9465 17.0629 21.9303 17.2924 20.8H20.7624C21.2245 20.7998 21.6803 20.6928 22.0943 20.4874C22.5082 20.2821 22.8692 19.9838 23.1489 19.616C23.4286 19.2482 23.6196 18.8207 23.7069 18.367C23.7943 17.9132 23.7756 17.4454 23.6524 17H23.6514ZM12.3924 22.8C11.7741 22.7974 11.1717 22.6039 10.6677 22.2459C10.1636 21.8879 9.78245 21.3829 9.57637 20.8H15.2084C15.0023 21.3829 14.6211 21.8879 14.1171 22.2459C13.613 22.6039 13.0106 22.7974 12.3924 22.8ZM21.5574 18.405C21.4641 18.5287 21.3431 18.6288 21.2042 18.6974C21.0653 18.766 20.9123 18.8011 20.7574 18.8H3.88537C3.73563 18.8 3.58781 18.7663 3.45282 18.7015C3.31783 18.6367 3.19911 18.5424 3.10543 18.4256C3.01174 18.3088 2.94549 18.1724 2.91156 18.0266C2.87763 17.8808 2.87688 17.7291 2.90937 17.583L4.92037 8.53298C5.27472 6.93918 6.15168 5.50958 7.41183 4.47143C8.67198 3.43327 10.243 2.84615 11.8751 2.80339C13.5073 2.76063 15.1069 3.26469 16.4197 4.23545C17.7325 5.2062 18.6831 6.58792 19.1204 8.16098L21.7204 17.532C21.7628 17.6802 21.7702 17.8362 21.7419 17.9877C21.7136 18.1392 21.6504 18.2821 21.5574 18.405Z" fill="#222222"/>
                  </g>
                  <defs>
                    <clipPath id="clip0_2593_1226">
                      <rect width="24" height="24" fill="white" transform="translate(0.392578 0.799805)"/>
                    </clipPath>
                  </defs>
                </svg>
              </a>
            </li>
            <button @click="toggleSearchBar">
              <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25" fill="none">
                <g clip-path="url(#clip0_2593_1224)">
                  <path d="M24.0994 22.8729L18.1304 16.9039C19.757 14.9145 20.5567 12.376 20.3642 9.81342C20.1717 7.25089 19.0016 4.86039 17.0959 3.13638C15.1903 1.41237 12.695 0.486752 10.126 0.550984C7.55705 0.615216 5.11106 1.66438 3.29397 3.48147C1.47688 5.29856 0.427716 7.74455 0.363484 10.3135C0.299252 12.8825 1.22487 15.3778 2.94888 17.2834C4.67289 19.1891 7.06339 20.3592 9.62592 20.5517C12.1885 20.7442 14.727 19.9445 16.7164 18.3179L22.6854 24.2869C22.874 24.469 23.1266 24.5698 23.3888 24.5675C23.651 24.5653 23.9018 24.4601 24.0872 24.2747C24.2726 24.0893 24.3778 23.8385 24.38 23.5763C24.3823 23.3141 24.2815 23.0615 24.0994 22.8729ZM10.3924 18.5799C8.81011 18.5799 7.26339 18.1107 5.9478 17.2316C4.63221 16.3526 3.60682 15.1031 3.00132 13.6413C2.39582 12.1795 2.2374 10.571 2.54608 9.01914C2.85476 7.46729 3.61669 6.04183 4.73551 4.92301C5.85433 3.80419 7.27979 3.04226 8.83164 2.73358C10.3835 2.4249 11.992 2.58332 13.4538 3.18882C14.9156 3.79432 16.1651 4.81971 17.0441 6.1353C17.9232 7.45089 18.3924 8.99761 18.3924 10.5799C18.39 12.7009 17.5464 14.7343 16.0466 16.2341C14.5468 17.7339 12.5134 18.5775 10.3924 18.5799Z" fill="#222222"/>
                </g>
                <defs>
                  <clipPath id="clip0_2593_1224">
                    <rect width="24" height="24" fill="white" transform="translate(0.392578 0.579102)"/>
                  </clipPath>
                </defs>
              </svg>
            </button>
            <button>
              English
              <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 24 25" fill="none">
                <g clip-path="url(#clip0_2593_1230)">
                  <path d="M12 0.799805C9.62663 0.799805 7.30655 1.50359 5.33316 2.82217C3.35977 4.14075 1.8217 6.01489 0.913451 8.2076C0.00519943 10.4003 -0.232441 12.8131 0.230582 15.1409C0.693605 17.4687 1.83649 19.6069 3.51472 21.2851C5.19295 22.9633 7.33115 24.1062 9.65892 24.5692C11.9867 25.0323 14.3995 24.7946 16.5922 23.8864C18.7849 22.9781 20.6591 21.44 21.9776 19.4667C23.2962 17.4933 24 15.1732 24 12.7998C23.9966 9.61826 22.7312 6.56802 20.4815 4.31832C18.2318 2.06863 15.1815 0.803246 12 0.799805V0.799805ZM20.647 7.79981H17.426C16.705 6.12879 15.7556 4.56589 14.605 3.1558C17.1515 3.84873 19.3223 5.51727 20.647 7.79981ZM16.5 12.7998C16.4918 13.8179 16.3314 14.8291 16.024 15.7998H7.97601C7.66866 14.8291 7.50821 13.8179 7.50001 12.7998C7.50821 11.7817 7.66866 10.7705 7.97601 9.79981H16.024C16.3314 10.7705 16.4918 11.7817 16.5 12.7998ZM8.77801 17.7998H15.222C14.3732 19.4755 13.2882 21.0206 12 22.3878C10.7114 21.021 9.62625 19.4758 8.77801 17.7998ZM8.77801 7.79981C9.62677 6.12408 10.7119 4.57896 12 3.2118C13.2886 4.57858 14.3738 6.12376 15.222 7.79981H8.77801ZM9.40001 3.1558C8.24767 4.56559 7.29659 6.1285 6.57401 7.79981H3.35301C4.67886 5.51624 6.85166 3.84756 9.40001 3.1558ZM2.46101 9.79981H5.90001C5.64076 10.7789 5.50636 11.7869 5.50001 12.7998C5.50636 13.8127 5.64076 14.8207 5.90001 15.7998H2.46101C1.84635 13.847 1.84635 11.7526 2.46101 9.79981ZM3.35301 17.7998H6.57401C7.29659 19.4711 8.24767 21.034 9.40001 22.4438C6.85166 21.7521 4.67886 20.0834 3.35301 17.7998ZM14.605 22.4438C15.7556 21.0337 16.705 19.4708 17.426 17.7998H20.647C19.3223 20.0823 17.1515 21.7509 14.605 22.4438ZM21.539 15.7998H18.1C18.3592 14.8207 18.4936 13.8127 18.5 12.7998C18.4936 11.7869 18.3592 10.7789 18.1 9.79981H21.537C22.1517 11.7526 22.1517 13.847 21.537 15.7998H21.539Z" fill="#222222"/>
                </g>
                <defs>
                  <clipPath id="clip0_2593_1230">
                    <rect width="24" height="24" fill="white" transform="translate(0 0.799805)"/>
                  </clipPath>
                </defs>
              </svg>
            </button>
            <a class="user" href="#">
              <div class="image-wrap"><img src="../assets/images/person.jpg" alt="img" loading="lazy"></div>
              <h3 class="name">محمد المكاوي</h3>
            </a>
          </ul>
        </div>
        <div class="search-bar" :style="{width : searchBarStyle}">
          <button class="close-search" @click="toggleSearchBar">X</button>
          <div class="input-wrap">
            <input type="text" placeholder="عن ماذا تبحث ...؟">
            <a href="">
              <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" class="bi bi-search" viewBox="0 0 16 16">
                <path d="M11.742 10.344a6.5 6.5 0 1 0-1.397 1.398h-.001c.03.04.062.078.098.115l3.85 3.85a1 1 0 0 0 1.415-1.414l-3.85-3.85a1.007 1.007 0 0 0-.115-.1zM12 6.5a5.5 5.5 0 1 1-11 0 5.5 5.5 0 0 1 11 0"/>
              </svg>
            </a>
          </div>
        </div>
      </div>
    </div>
    <nuxt />
    <section class="footer">
      <div class="container">
        <hr>
        <div class="image-wrap"><img src="../assets/images/logo.png" alt="img" loading="lazy"></div>
        <ul>
          <li><a href="">الرئيسيه</a></li>
          <li><a href="">عن المنصه</a></li>
          <li><a href="">الاسئله الشائعه</a></li>
          <li><a href="">الشروط والاحكام</a></li>
          <li><a href="">اتصل بنا</a></li>
        </ul>
        <div class="copyright">
          <p>جميع الحقوق محفوظة لدى منصة ميم التعليمية</p>
          <div class="image-wrap"><img src="../assets/images/ryad.png" alt="img" loading="lazy"> <span>تصميم شركة الرياض</span></div>
        </div>
      </div>
    </section>
  </div>
</template>

<script>
export default {
  data() {
    return {
      mobilemenuStyleHeight:'0%',
      searchBarStyle:'0%',
      }
  },
  computed: {
    getCartProductsLength() {
      return this.$store.state.cartProducts?.length
    }
  },
  methods: {
    toggleMobileMenu() {
      this.mobilemenuStyleHeight = this.mobilemenuStyleHeight === '0%' ? '100%' : '0%';
    },
    toggleSearchBar() {
      this.searchBarStyle = this.searchBarStyle === '0%' ? '100%' : '0%';
    }
  }
}
</script>

<style lang="scss" scoped>
.nav-bar{
  padding: 18px 0;
  background: #FFF;
  box-shadow: 0px 2px 10px 0px rgba(0, 0, 0, 0.08);
  .content{
    display: flex;
    flex-direction: row;
    gap: 40px;
    justify-content: space-between;
    align-items: baseline;
    @media (max-width: 991px){
      align-items: center;
    }
    .logo{
      max-width: 140px;
    }
    ul.navbar-links{
      display: flex;
      flex-direction: row;
      gap: 35px;
      list-style: none;
      justify-content: space-between;
      li{
        font-size: 16px;
        font-weight: 400;
        color: #222;
        a{
          color: inherit;
          text-decoration: unset;
        }
      }
      li.has-submenu{
        position: relative;
        cursor: pointer;
        &::after{
          content: url('../assets/images/down.png');
          position: absolute;
          top: 50%;
          transform: translateY(-50%);
          height: 16px;
        }
        > .submenu{
          position: absolute;
          right: 0;
          bottom: -145px;
          width: 200px;
          height: fit-content;
          background: #222;
          list-style: none;
          padding: 15px 10px;
          display: flex;
          flex-direction: column;
          align-items: flex-start;
          gap: 20px;
          li{
            color: #fff;
          }
        }
      }
      @media (max-width:991px){
        display: none;
      }
    }
    ul.icons{
      list-style: none;
      display: flex;
      align-items: center;
      gap: 24px;
      button{
        border: unset;
        background: transparent;
      }
      li{
        position: relative;
        .badge{
          position: absolute;
          right: -12px;
          top: -12px;
          color: #fff;
          border-radius: 50%;
        }
      }
      .user{
        display: flex;
        flex-direction: row;
        gap: 7px;
        align-items: center;
        .image-wrap{
          width: 38px;
          height: 38px;
          border-radius: 50%;
          overflow: hidden;
        }
        h3{
          font-size: 14px;
          font-weight: 400;
          color: #222222;
        }
      }
      @media (max-width:991px){
        display: none;
      }
    }
    .mobile-menu-btn{
      background: transparent;
      border: unset;
      display: none;
      svg{
        width: 40px;
        height: 40px;
      }
      @media (max-width : 991px){
        display: flex;
      }
    }
  }
}
.mobile-menu{
  position: fixed;
  top: 0%;
  left: 0;
  width: 100%;
  // height: 0%;
  background: #222;
  z-index: 9;
  transition: 1s;
  overflow: hidden;
  button.close-icon{
  position: absolute;
  right: 20px;
  top: 0px;
  font-size: 45px;
  font-weight: 700;
  color: #fff;
  }
  .mobile-links{
    display: flex;
    justify-content: center;
    gap: 20px;
    flex-direction: column;
    text-align: center;
    padding: 50px 0;
    li{
      color: #FFF;
      position: relative;
      font-size: 20px;
      &.has-submenu{
        &::after{
          content: url('../assets/images/down.png');
          position: absolute;
          top: 50%;
          transform: translateY(-50%);
          height: 16px;
          filter: invert(1);
        }
      }
    }
  }
  .mobile-icons{
    display: flex;
    flex-direction: column;
    gap: 30px;
    justify-content: center;
    align-items: center;
    a{
      &:hover{
        border-bottom: unset;
      }
    }
    li{
      svg{
        filter: invert(1);
      }
    }
    button{
      color: #fff;
      svg{
        filter: invert(1);
      }
    }
    .user{
      display: flex;
      gap: 5px;
      align-items: center;
      .image-wrap{
        width: 30px;
        height: 30px;
        border-radius:50% ;
        overflow: hidden;
      }
      h3{
        font-size: 15px;
        color: #FFF;
      }
    }
  }
}
.search-bar{
  position: fixed;
  top: 0;
  left: 0;
  width: 0%;
  height: 100%;
  background: #222;
  display: flex;
  align-items: center;
  justify-content: center;
  overflow: hidden;
  transition: 2s;
  z-index: 9;
  .close-search{
    position: absolute;
    right: 20px;
    top: 0px;
    font-size: 45px;
    font-weight: 700;
    color: #fff;
  }
  .input-wrap{
    max-width: 700px;
    display: flex;
    align-items: center;
    width: 100%;
    height: 50px;
    input{
      padding-inline-end: 15px;
    }
    a{
      width: 60px;
      height: 100%;
      background: #2A7DE5;
      display: flex;
      align-items: center;
      justify-content: center;
      transition: 0.6s;
      border: 3px solid transparent;
      svg{
        filter: invert(1);
      }
      &:hover{
        background: #fff;
        border: 3px solid #2A7DE5;
        svg{
          filter: invert(0);
          fill: #2A7DE5 !important;
        }
      }
    }
  }
  @media (max-width : 560px){
    .input-wrap{
      flex-direction: column;
      margin: 0 15px;
      gap: 5px;
      height: unset;
      input{
        height: 50px;
      }
      a{
        height: 30px;
        width: 100%;
        font-size: 26px;
      }
    }
  }
}
.footer{
  .image-wrap{
    max-width: 140px;
    margin: 0 auto 34px;
  }
  ul{
    list-style: none;
    margin: 0;
    padding: 0;
    display: flex;
    flex-direction: row;
    gap: 36px;
    align-items: center;
    justify-content: center;
    margin-bottom: 100px;
    li{
      a{
        font-size: 16px;
        font-weight: 400;
        color: #3E3E3E;
      }
    }
  }
  .copyright{
    display: flex;
    flex-direction: row;
    align-items: center;
    justify-content: space-between;
    gap: 20px;
    p{
      font-size: 13px;
      font-weight: 400;
      color: #3E3E3E80;
    }
    .image-wrap{
      display: flex;
      gap: 10px;
      align-items: center;
      margin: unset;
      img{
        width: 20px;
        height: 20px;
      }
      span{
        font-size: 14px;
        font-weight: 400;
        color: #2E386B;
      }
    }
  }
  @media (max-width : 540px){
    ul{
      flex-wrap:wrap ;
      margin-bottom: 40px;
    }
    .copyright{
      flex-wrap: wrap;
      gap: 20px;
      justify-content: center;
    }
  }
}
</style>
